# SpotLightDistribution Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpotLightDistribution Class
Members See Also
---
This class encapsulates a spot light distribution.
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class SpotLightDistribution : LightDistribution
```

Visual Basic
---
```text
Public Class SpotLightDistribution _
	Inherits LightDistribution
```

Visual C++
---
```text
public ref class SpotLightDistribution : public LightDistribution
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Lighting..::..LightDistribution Autodesk.Revit.DB.Lighting..::..SpotLightDistribution
# See Also
SpotLightDistribution Members
Autodesk.Revit.DB.Lighting Namespace